app/controllers/admin/products_controller.rb

  def create
    @product = Product.create(params[:product])
---
INSERT INTO "products" ("created_at", "description", "image", "name", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)