app/controllers/pages_controller.rb

SELECT "products".* FROM "products"
---
  def home
    @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def add_to_cart
    @cart = find_cart
    product = Product.find(params[:id])